app/controllers/creatures_controller.rb

SELECT "creatures".* FROM "creatures"
---
	def allcreatures
		@Creatures = Creature.all

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", nil]]
---
	def show
		@Creature = Creature.find(params[:id])

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "creatures" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "creatures"."id" = $4  [["name", "to"], ["description", "do"], ["updated_at", "2015-11-12 23:48:30.405820"], ["id", 2]]
---
	def update
		@Creature = Creature.find_by(id: params[:id]);
		@Creature.name = params[:name]
		@Creature.description = params[:description]
		@Creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 4]]
---
	def delete
		@Creature = Creature.find_by(id: params[:id])
		@Creature.destroy